add new batch of TILs
