--- a/python/wsgi-vs-asgi.md
+++ b/python/wsgi-vs-asgi.md
@@ -1,101 +1,109 @@
 
 WSGI standard is used to build 2 components: WSGI _server_ and WSGI \_application. They depends on each other: WSGI server converts HTTP request to standardized WSGI environment, WSGI application received the environment and return a WSGI response, and then WSGI server converts the WSGI resposne to HTTP response.
 
-```d2
-HTTP Request/Response Flow with WSGI: {
-  shape: sequence_diagram
+```mermaid
+sequenceDiagram
+    participant ClientBrowser as Client Browser
+    participant HTTPWSGIServer as HTTP+WSGI Server
+    participant WSGIApp as WSGI Application
 
-  client_browser: "Client Browser"
-  http_wsgi_server: "HTTP+WSGI Server"
-  wsgi_app: "WSGI Application"
-
-  client_browser.t1 -> http_wsgi_server.t1: "HTTP Request"
-
-  convert_http_req_to_wsgi_env_dict: "Convert HTTP to WSGI" {
-    http_wsgi_server.t1 -> http_wsgi_server.t1: "Create WSGI\nEnvironment\nDictionary from\nHTTP Request"
-  }
-
-  http_wsgi_server.t1 -> wsgi_app.t1: "Standardized WSGI Environment"
-  wsgi_app.t1 -> http_wsgi_server.t1: "WSGI Response"
-
-  convert_wsgi_res_to_http_res: "Convert WSGI to HTTP" {
-    http_wsgi_server.t1 -> http_wsgi_server.t1: "Create HTTP\nResponse\n from WSGI\nResponse"
-  }
-
-  http_wsgi_server.t1 -> client_browser.t1: "HTTP Response"
-  http_wsgi_server."WSGI Server acts as a translator."
-}
+    ClientBrowser->>HTTPWSGIServer: HTTP Request
+    HTTPWSGIServer->>HTTPWSGIServer: Create WSGI Environment Dictionary from HTTP Request
+    HTTPWSGIServer->>WSGIApp: Standardized WSGI Environment
+    WSGIApp->>HTTPWSGIServer: WSGI Response
+    HTTPWSGIServer->>HTTPWSGIServer: Create HTTP Response from WSGI Response
+    HTTPWSGIServer->>ClientBrowser: HTTP Response
+    Note right of HTTPWSGIServer: WSGI Server acts as a translator.
 ```
-
-Illustation by sequence diagram:
 
